package com.javarush.test.level03.lesson12.home02;

/* Я не хочу изучать Java, я хочу большую зарплату
Вывести на экран десять раз надпись «Я не хочу изучать Java, я хочу большую зарплату»
*/

public class Solution
{
    public static void main(String[] args)
    {
      print10("Я не хочу изучать Java, я хочу большую зарплату");
        //напишите тут ваш код
    }
    public static void print10(String z) {
        System.out.println(z);
        System.out.println(z);
        System.out.println(z);
        System.out.println(z);
        System.out.println(z);
        System.out.println(z);
        System.out.println(z);
        System.out.println(z);
        System.out.println(z);
        System.out.println(z);
    }
}
